IanBallinger/Robotics_final_spring2026_thursPM/mobile_robot/src/esp32/src/elevator/elevator_control.cpp
#include "Adafruit_VL53L0X.h"
#include <Arduino.h>
#include <Wire.h>
#include <math.h>
#include <ESP32Servo.h>
#include "PID.h"
#include <esp_now.h>
#include <WiFi.h>
#include "robot_pinout.h"
#include "MotorDriver.h"
#include "PID.h"
#include "util.h"
#include "arm_control.h"
#include "EncoderVelocity.h"

#define TCAADDR 0x70

struct DesiredElevatorState {
  float height_m;

  DesiredElevatorState() : height_m(0.0f) {}
  explicit DesiredElevatorState(float height_m_) : height_m(height_m_) {}
};

struct DesiredArmPosition {
  float xE;
  float yE;

  DesiredArmPosition() : xE(0.0f), yE(0.0f) {}
  DesiredArmPosition(float xE_, float yE_) : xE(xE_), yE(yE_) {}
};

struct DesiredArmJointAngles {
  float theta1;
  float theta2;

  DesiredArmJointAngles() : theta1(0.0f), theta2(0.0f) {}
  DesiredArmJointAngles(float theta1_, float theta2_) : theta1(theta1_), theta2(theta2_) {}
};

struct DesiredElevatorJogCommand {
  float drive;

  DesiredElevatorJogCommand() : drive(0.0f) {}
  explicit DesiredElevatorJogCommand(float drive_) : drive(drive_) {}
};

enum class PinchCommand {
  OPEN,
  CLOSE,
};

Adafruit_VL53L0X lox = Adafruit_VL53L0X();
String rx_line = "";

constexpr uint8_t TOF_MUX_CHANNEL = 0;
constexpr unsigned long CMD_APPLY_PERIOD_MS = 50;
constexpr unsigned long MEAS_PUBLISH_PERIOD_MS = 50;
constexpr unsigned long ACK_PUBLISH_PERIOD_MS = 50;
constexpr unsigned long CMD_TIMEOUT_MS = 250;
constexpr bool SERIAL_DEBUG_TIMING = true;
constexpr float MM_TO_M = 1.0f / 1000.0f;
constexpr float ELEVATOR_JOG_RATE_MPS = 0.08f;

constexpr int ELEVATOR_ENCODER_A_PIN = 4;
constexpr int ELEVATOR_ENCODER_B_PIN = 5;
constexpr int ELEVATOR_ENCODER_CPR = CPR_312_RPM;
constexpr float ELEVATOR_ENCODER_TAU_S = 0.5f;
constexpr float ELEVATOR_ENCODER_SIGN = 1.0f;
constexpr float ELEVATOR_METERS_PER_RAD = 0.018f;
constexpr float ELEVATOR_METERS_BIAS = -0.02f;

constexpr int PINCH_LEFT_SERVO_PIN = 40;
constexpr int PINCH_RIGHT_SERVO_PIN = 41;
constexpr int SERVO_MIN_US = 544;
constexpr int SERVO_MAX_US = 2400;
constexpr float RAD_TO_DEG_FACTOR = 180.0f / PI;
constexpr float PINCH_OPEN_ANGLE_DEG_L = 0.0f;
constexpr float PINCH_CLOSE_ANGLE_DEG_L = 90.0f;
constexpr float PINCH_OPEN_ANGLE_DEG_R = 0.0f;
constexpr float PINCH_CLOSE_ANGLE_DEG_R = -90.0f;
constexpr float ARM_BASE_X_M = 0.0f;
constexpr float ARM_BASE_Y_M = 0.0f;
constexpr float ARM_LINK_1_M = 0.26f;
constexpr float ARM_LINK_2_M = 0.16f;

constexpr float SHOULDER_MIN_DEG = -180.0f;
constexpr float SHOULDER_MAX_DEG = 180.0f;
constexpr float ELBOW_MIN_DEG = -180.0f;
constexpr float ELBOW_MAX_DEG = 180.0f;
constexpr unsigned long ARM_UPDATE_PERIOD_MS = 20;
constexpr float ARM_SHOULDER_RATE_RAD_S = 1.2f;
constexpr float ARM_ELBOW_RATE_RAD_S = 1.2f;
constexpr float ARM_JOINT_REACHED_EPS_RAD = 0.01f;
constexpr bool ELEVATOR_USE_TOF_SENSOR = true;

DesiredElevatorState latest_rx_cmd;
DesiredElevatorState latest_applied_cmd;
DesiredArmPosition latest_arm_cmd;
DesiredArmJointAngles latest_arm_joint_angles_cmd;
bool has_valid_elevator_cmd = false;
bool ack_dirty = false;
unsigned long last_cmd_rx_ms = 0;
unsigned long last_cmd_apply_ms = 0;
unsigned long last_meas_publish_ms = 0;
unsigned long last_ack_publish_ms = 0;
unsigned long last_ack_debug_ms = 0;
unsigned long last_meas_debug_ms = 0;
unsigned long last_arm_update_ms = 0;

bool has_valid_arm_target = false;
float target_shoulder_rad = 0.0f;
float target_elbow_rad = 0.0f;
float applied_shoulder_rad = 0.0f;
float applied_elbow_rad = 0.0f;

MotorDriver elevator_driver {B_DIR1, B_PWM1, 0};
EncoderVelocity elevator_encoder {ELEVATOR_ENCODER_A_PIN,
                                  ELEVATOR_ENCODER_B_PIN,
                                  ELEVATOR_ENCODER_CPR,
                                  ELEVATOR_ENCODER_TAU_S};
Servo shoulder_servo;
Servo elbow_servo;
Servo pinch_left_servo;
Servo pinch_right_servo;

bool tof_sensor_available = false;
bool encoder_height_initialized = false;
float encoder_zero_height_m = 0.0f;
float encoder_zero_position_rad = 0.0f;

constexpr float ELEVATOR_ENCODER_MAX_SPEED_MPS = 1.0f;
constexpr float ELEVATOR_ENCODER_JUMP_MARGIN_M = 0.01f;
constexpr float ELEVATOR_TOF_CORRECTION_GAIN = 0.15f;
constexpr float ELEVATOR_ENCODER_REANCHOR_GAIN = 0.05f;
constexpr float ELEVATOR_ENCODER_REANCHOR_WINDOW_M = 0.03f;

bool elevator_height_filter_initialized = false;
bool last_encoder_height_valid = false;
float fused_elevator_height_m = NAN;
float last_encoder_height_m = NAN;
float last_tof_height_m = NAN;
unsigned long last_height_update_ms = 0;

volatile bool has_pending_wireless_pinch_cmd = false;
volatile PinchCommand pending_wireless_pinch_cmd = PinchCommand::OPEN;
volatile bool has_pending_wireless_elevator_jog_cmd = false;
volatile float pending_wireless_elevator_jog_drive = 0.0f;

float wireless_elevator_jog_drive = 0.0f;
unsigned long last_wireless_elevator_jog_ms = 0;
unsigned long last_wireless_elevator_jog_update_ms = 0;

#define Kp 3.5f
#define Ki 0.1f
#define Kd 0.0f

double integral_min = -1e6;
double integral_max = 1e6;

PID pid = {Kp, Ki, Kd, 0.0, 0.1f, false};

double shoulder_ms = 0.0;
double elbow_ms = 0.0;
double pinch_left_ms = 0.0;
double pinch_right_ms = 0.0;

static bool handlePinchCommand(const String& line, PinchCommand& cmd);
static bool handleElevatorJogCommand(const String& line, DesiredElevatorJogCommand& cmd);
static float readEncoderHeightMeters();

static void onElevatorWirelessSend(const uint8_t* mac_addr, esp_now_send_status_t status) {
  (void)mac_addr;
  (void)status;
}

static void onElevatorWirelessRecv(const uint8_t* mac, const uint8_t* incomingData, int len) {
  (void)mac;
  if (incomingData == nullptr || len <= 0) {
    return;
  }

  String line;
  line.reserve(len);
  for (int i = 0; i < len && incomingData[i] != '\0'; ++i) {
    line += static_cast<char>(incomingData[i]);
  }
  line.trim();

  PinchCommand pinch_cmd = PinchCommand::OPEN;
  if (handlePinchCommand(line, pinch_cmd)) {
    pending_wireless_pinch_cmd = pinch_cmd;
    has_pending_wireless_pinch_cmd = true;
    return;
  }

  DesiredElevatorJogCommand elevator_jog_cmd;
  if (handleElevatorJogCommand(line, elevator_jog_cmd)) {
    pending_wireless_elevator_jog_drive = elevator_jog_cmd.drive;
    has_pending_wireless_elevator_jog_cmd = true;
  }
}

static void setupElevatorWireless() {
  WiFi.mode(WIFI_STA);
  if (esp_now_init() != ESP_OK) {
    Serial.println("ERR,ESP_NOW_INIT_FAILED");
    return;
  }

  esp_now_register_send_cb(onElevatorWirelessSend);
  esp_now_register_recv_cb(onElevatorWirelessRecv);
  Serial.println("ESP_NOW_READY");
}

void tcaSelect(uint8_t channel) {
  if (channel > 7) {
    return;
  }
  Wire.beginTransmission(TCAADDR);
  Wire.write(1 << channel);
  Wire.endTransmission();
}

static void printDebugTiming(const char* tag, unsigned long& last_ms) {
  if (!SERIAL_DEBUG_TIMING) {
    return;
  }

  const unsigned long now = millis();
  Serial.print("DBG,");
  Serial.print(tag);
  Serial.print(",dt_ms,");
  if (last_ms == 0) {
    Serial.println("FIRST");
  } else {
    Serial.println(now - last_ms);
  }
  last_ms = now;
}

